# def - ვიყენებთ ფუნქციის შესაქმნელად




def sum(list1):
    for i in range(len(list1)):
        print( list1[i])




numbers=[1,2,3,4,5,6]
sum(numbers)




# როცა ფუნქციაში ვიყენებთ print-ს შემდეგა გარ არის საწირო print-ის გამოყენება

# parameter -პარამეტრი  არის ის რასაც გადავცემთ ფუნქციის ფრჩხილების შიგნით 
# arguments - არგუმენტი, გამოიყენება პარამეტრისთვის მნიშვნელობის მისანიწებლად,ანუ როდესაც პარამეტრი იქმნება
#პარამეტრი მოელის რაგაც მნიშვნელოაბს რომელიც გადაეცემა არგუმენტის სახით ფუნქციის გამოსაძახებლად

#returne - დაბრუნება returne -ს გამოყენებით შემიძლია დავაბრუნო რაღაც მნიშვნელობა ანუ ეს მნიშვნელობა 
#როდესაც ფუნქციაში ვიყენებთ returne- მაშინ ფუნქციის გამოსაძახებლათ გვჭირდება რომ ფუნქცია ცჰავსვატ print - ში

#როცა returne -ს იყენებ ბრუნდება რაგაც ერთი მნიშვნელობა და შემდეგ ყველაფერი წყვეტს მუშაობას