# 1) ფუნქცია არის კოდის ბლოკი, რომელსაც აქვს სახელი
# და გამოიყენება კონკრეტული მოქმედების შესასრულებლად.
# ფუნქცია გვაძლევს საშუალებას ერთსა და იმავე კოდს მრავალჯერ გამოვიყენოთ

# 2) არგუმენტი არის მნიშვნელობა, რომელსაც ფუნქცია იღებს
# მუშაობის დროს რათა იმ მონაცემებზე იმუშაოს

# 3) ჩაშენებული ფუნქცია არის Python-ში უკვე არსებული ფუნქცია
# რომელიც დამატებით შექმნას არ საჭიროებს
# მაგალითები
# print()  -> ბეჭდავს ინფორმაციას ტერმინალში
# len()    -> აბრუნებს ობიექტის სიგრძეს
# type()   -> აბრუნებს მონაცემის ტიპს




#5)შექმენით შენი საკუთარი ფუნქცია სახელად five_plus_five()
# რომელიც 5 ს უამატებს 5 ს და გამოაქვს ტერმინალში პასუხი

def five_plus_five():
    print(5 + 5)



# 6) შექმენი ფუნქცია სახელად greet() 

# ფუნქციაში შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს

# შემდეგ დაპრინტეთ შემდეგი ტექსტი --> 'მოგესალმებით ,ჩემი სახელია ' name


def greet():
    name = "Dato"
    print("მოგესალმებით, ჩემი სახელია", name)



# 7)შექმენი ფუნქცია სახელად more_or_less()

# შენმა ფუნქციამ უნდა შეადაროს ორი რიცხვი, 5 და 7 

# და დაპრინტოს შედეგი მეტია თუ არა ხუთ შევიდზე,პასუხი უნდა იყოს boolean

# არ გამოიყენოთ if else,უბრალოდ პრინტში შეადარეთ

# გამოიძახეთ ფუნქცია რომ ნახოთ შედეგი ტერმინალში

def more_or_less():
    print(5 > 7)


